package searchengine.config;

public class TemporaryText {
    public static final String TEXT = "Мистер Шерлок Холмс сидел за столом и завтракал.  Обычно  он  вставал\n" +
            "довольно поздно, если не считать тех нередких случаев, когда ему вовсе  не\n" +
            "приходилось ложиться. Я стоял на коврике у камина и вертел в руках  палку,\n" +
            "забытую нашим вчерашним посетителем, хорошую толстую палку с набалдашником\n" +
            "- из тех, что именуются \"веским доказательством\". Чуть  ниже  набалдашника\n" +
            "было врезано  серебряное  кольцо  шириной  около  дюйма.  На  кольце  было\n" +
            "начертано: \"Джеймсу Мортимеру, Ч. К. X. О., от его друзей по ЧКЛ\" и  дата:\n" +
            "\"1884\". В прежние  времена  с  такими  палками  -  солидными,  увесистыми,\n" +
            "надежными - ходили почтенные домашние врачи.\n" +
            "     - Ну-с, Уотсон, какого вы мнения о ней?\n" +
            "     Холмс сидел спиной ко мне, и я думал, что  мои  манипуляции  остаются\n" +
            "для него незаметными.\n" +
            "     - Откуда вы знаете, чем я занят? Можно подумать, что у вас  глаза  на\n" +
            "затылке!\n" +
            "     - Чего нет, того нет, зато передо мной  стоит  начищенный  до  блеска\n" +
            "серебряный кофейник, - ответил он. - Нет, в самом  деле,  Уотсон,  что  вы\n" +
            "скажете о палке нашего посетителя? Мы с вами прозевали  его  и  не  знаем,\n" +
            "зачем он приходил. А раз уж нам так не повезло, придется  обратить  особое\n" +
            "внимание  на  этот  случайный  сувенир.  Обследуйте  палку  и   попробуйте\n" +
            "воссоздать по ней образ ее владельца, а я вас послушаю.\n" +
            "     - По-моему, - начал я, стараясь по мере сил  следовать  методу  моего\n" +
            "приятеля, - этот доктор Мортимер - преуспевающий медик средних лет, к тому\n" +
            "же всеми уважаемый, поскольку друзья наделяют его такими знаками внимания.\n" +
            "     - Хорошо! - сказал Холмс. - Превосходно!\n" +
            "     -  Кроме  того,  я  склонен  думать,  что   он   сельский   врач,   а\n" +
            "следовательно, ему приходится делать большие концы пешком.\n" +
            "     - А это почему?\n" +
            "     - Потому что его палка, в прошлом весьма недурная, так сбита,  что  я\n" +
            "не  представляю  себе  ее  в  руках  городского  врача.  Толстый  железный\n" +
            "наконечник совсем стерся - видимо, доктор Мортимер исходил  с  ней  немало\n" +
            "миль.\n" +
            "     - Весьма здравое рассуждение, - сказал Холмс.\n" +
            "     - Опять же надпись: \"От друзей по ЧКЛ\". Я  полагаю,  что  буквы  \"КЛ\"\n" +
            "означают  клуб,  вернее  всего  охотничий,  членам  которого  он  оказывал\n" +
            "медицинскую помощь, за что ему и преподнесли этот небольшой подарок.\n" +
            "     - Уотсон, вы превзошли самого себя! - сказал  Холмс,  откидываясь  на\n" +
            "спинку стула и закуривая папиросу. - Я не могу не отметить, что,  описывая\n" +
            "со  свойственной  вам  любезностью  мои  скромные   заслуги,   вы   обычно\n" +
            "преуменьшаете свои собственные возможности. Если от вас самого не  исходит\n" +
            "яркое сияние, то вы, во всяком случае, являетесь проводником  света.  Мало\n" +
            "ли таких людей, которые, не блистая талантом, все же  обладают  недюжинной\n" +
            "способностью зажигать его в других! Я у вас в неоплатном долгу, друг мой.";
}
